module attributes {torch.debug_module_name = "Conv2dNoPaddingOutModule"}  {
  func @forward(%arg0: tensor<5x2x10x20xf32>, %arg1: tensor<5x10x8x18xf32>) -> tensor<?x?x?x?xf32> {
    %c0_i64 = arith.constant 0 : i64
    %c1_i64 = arith.constant 1 : i64
    %c3_i64 = arith.constant 3 : i64
    %cst = arith.constant dense<"0x004CE7BABD79013E42A646BE27A031BEC8EBB9BDC671813DE00699BB015F3F3E805AABBC74777F3D3EE291BD7CC53DBD029566BE0BD91FBED4FCC6BD900D0F3CE2D5BE3D2BD2103E94A023BEB234D2BDDE54AF3DF56B483EE0AF46BDA39C343EC09C1BBD4850CC3C818B5A3ED6E65FBED9F117BE3C6A74BDDE29BCBDD388503EAE711CBE0836DEBD8D9F28BE2B0C62BE1EE40CBEC9784F3ED265D73DD6F5E93D60184B3C4F7BF7BD4C56233D115B61BEE0652EBE11DBF8BD5948183E93830D3E4815D6BD50570BBC235D1A3E6FF16F3E0E95BF3D6C6C023DF7D3213EE11C0EBE3CE7333D86203BBE5C4827BE435DF9BDBE6ADA3D5221C23D3DF80EBE26D5913DD97F043EB0B5F3BC9072133C3CB25F3DC9BB153E69C0673E3DFF39BED0E6B0BD8AB6BD3D5BFA473E4F08523E01F7543ECC22403DB7E151BE38A0B13CDCFE16BE85EF60BE1D72563E0F85373E31C370BEE4B3343D30A322BD94DF1EBDB4F7DCBDDEA1B93D36F50EBED6F5B03D521DF43D39C82C3E667EB43DB2E16EBEA4911CBE4A07F13D34114A3DC8473CBEB2FA0ABEF50E633ED1A1223E307AD2BD54FC72BD11EB65BEC0D28ABBF4C135BE8A2C3ABEE0C754BC9CF4103D10B0C5BD93370F3E60E012BE85005B3E4367253EB6884BBE304870BD90402E3CB4DB0C3D0CFA643DAA6EBD3DB051673C3888EBBDBE6AE43D028667BE1F0E0FBE74AD71BD7523EBBDF6DEA8BDBBD245BEEC5C4DBD445E4E3DBA3C1DBEB02E46BCF1C62C3E887EC6BC20A7D63B0893A6BCEC62433D3577193E63A0643ECB46193E4D26653ED8A48BBC6ED158BE81D8E4BDBB57243E0045C8BAEFEEEFBDD2F438BE5DE061BE86B54BBE74D343BDDF5C043E197D023E41C668BE358E163EA4DD3CBE6C1A4CBDA2BAC3BD34F539BD708E3DBD669558BE0B6650BE2C1217BD80C3473B6A49DBBDEED6B53DC03C59BE304F82BC8341543E9CE5C4BDB3F2593E76D1AE3D32D159BE0FB5183EE0CFDEBC1C7DD7BDED00413E880A43BE"> : tensor<10x2x3x3xf32>
    %0 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>, variant = "out"} ins(%arg0, %cst : tensor<5x2x10x20xf32>, tensor<10x2x3x3xf32>) outs(%arg1 : tensor<5x10x8x18xf32>) -> tensor<5x10x8x18xf32>
    %1 = tensor.cast %0 : tensor<5x10x8x18xf32> to tensor<?x?x?x?xf32>
    return %1 : tensor<?x?x?x?xf32>
  }
}
